app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index #find all articles from database
    #Article.all runs: SELECT * FROM articles
    @articles = Article.all